<!DOCTYPE Html >
<html>
    <head>
        <title>Тестовое задание</title>
    </head>
    <body>
        <a href="t1.php">1. Написать собственную реализацию квайна (интроспективной программы) с применением объекта</a><br />
        <a href="t2/index.php">2. Написать скрипт преобразования десятичного числа в двоичное и наоборот, без использования штатных функций. Десятичное число может быть с плавающей точкой.</a><br />
        <a href="t3/index.php">3. Сделать перенаправление на другую страницу при фатальной ошибке скрипта уровня E_ERROR.</a><br />
        <a href="sql/index.php">SQL</a><br />
    </body>
</html>